[
  {
    "title": "Computer Architecture",
    "author": "Charles Fox",
    "isbn_10": "1718502869",
    "isbn_13": "978-1718502864",
    "publisher": "No Starch Press",
    "read_on": 2024,
    "review": "Computer Architecture walks you through the evolution of Computer Systems, it starts by establishing \"What is a computer\" then explains how Humans went through different machinery before getting into programmable systems, then it explains how these programmable systems used for non-data production drived the evolution to machines like Babbage's Analytical Machine. At some point in the book the Sillicon joins the story and here is when Charles Fox goes from the most simple transistor to how the Sillicon performs changes on state and flow on electrons causing data to be stored in our CPU registers. Finally he walks you through machines of different magnitudes, data centers, storege hardware and how these systems are programmed. Theres also an actity to assamble the Manchester Baby using Logisim.",
    "shopping": {
      "amazon": "https://www.amazon.com/Computer-Architecture-Charles-Fox/dp/1718502869/"
    }
  },
  {
    "title": "Street Coder: The rules to break and how to break them",
    "author": "Sedat Kapanoglu",
    "isbn_10": "1617298379",
    "isbn_13": "978-1617298370",
    "publisher": "Manning",
    "read_on": 2023,
    "review": "Either if you are a Self-Taught programmer or a CS degree backed programmer, this book is for you. It covers from daily life programmer experiences that most of us face through our career to more specific topics such as security, anti-patters, testing, refactoring and scalability. Is important to note that this book don't goes depth into these topics but instead it gives you a brief on them an Sedat will also share his POV on these topics.",
    "shopping": {
      "amazon": "https://www.amazon.com/Street-Coder-rules-break-them/dp/1617298379/"
    }
  },
  {
    "title": "Rust in Action",
    "author": "Tim McNamara",
    "isbn_10": "1617294551",
    "isbn_13": "978-1617294556",
    "publisher": "Manning",
    "read_on": 2021,
    "review": "Rust in Action its a great introduction into System's Programming. This book not only made me improve my way of thinking around Rust, but also to play around with whats available in a Computer System.  Tim McNamara does a great job explaining the fundamentals on System's Programming and also applies Rust on top of it. If you didn't know he is also doing Rust courses on LinkedIn Learning!",
    "shopping": {
      "amazon": "https://www.amazon.com/Rust-Action-TS-McNamara/dp/1617294551"
    }
  },
  {
    "title": "Understanding the Machine. (Vol. 1 from Write Great Code Series)",
    "author": "Randall Hyde",
    "isbn_10": "171850036X",
    "isbn_13": "978-1718500365",
    "publisher": "No Starch Press",
    "read_on": 2020,
    "review": "Randall Hyde goes into the depth understanding on how computers work. This book is great for those who want to understand how the computer works from the ground up, Randall continuously explains how High-Level Code gets translated into Machine Code and how the CPU executes it. It is a great introduction if you are jumping into Systems Programming.",
    "shopping": {
      "amazon": "https://www.amazon.com/Write-Great-Code-2nd-Understanding/dp/171850036X"
    }
  },
  {
    "title": "The Rust Programming Language",
    "author": "Steve Klabnik & Carol Nichols",
    "isbn_10": "1593278284",
    "isbn_13": "978-1593278281",
    "publisher": "No Starch Press",
    "read_on": 2019,
    "review": "I started to learn Rust back in 2018 writing simple programs. I was looking into understanding better the key concepts of the language and how to \"Think in Rust\". It doesnt matter which language you come from, at the beginning with Rust you will feel like you are fighting the compiler, if you come from dynamic programming languages like JavaScript or Python, lower level concepts like memory management and pointers might sound \"alien\" to you. Well this book not only goes through these concepts, but also walks you through Systems Programming using a practical approach. You can also read the book for free online on it's mdBook version.",
    "shopping": {
      "amazon": "https://www.amazon.com/Rust-Programming-Language-Steve-Klabnik/dp/1593278284",
      "online": "https://doc.rust-lang.org/book/ch00-00-introduction.html"
    }
  },
  {
    "title": "The Go Programming Language",
    "author": "Alan Donovan & Brian Kernighan",
    "isbn_10": "9780134190440",
    "isbn_13": "978-0134190440",
    "publisher": "Addison-Wesley Professional",
    "read_on": 2018,
    "review": "Golang was a thing back in 2018, dont't get me wrong, it is still very popular. But by 2018/19 it was a thing on the internet, everyone was getting a taste of Golang, either in DevOps land or WebDev for Servers. Well I got interest into it too, and as it was really different to my background languages I decided to grab a book and get into it. I learned Golang and used it  for a little while, it called my attention the First-Class Citizen Support for imaginary numbers!",
    "shopping": {
      "amazon": "https://www.amazon.com/Programming-Language-Addison-Wesley-Professional-Computing/dp/0134190440"
    }
  },
  {
    "title": "Fullstack React: The Complete Guide to ReactJS and Friends",
    "author": "Anthony Accomazzo, Nathaniel Murray & Ari Lerner",
    "isbn_10": "B07YL7J1C6",
    "isbn_13": "N/A",
    "publisher": "N/A",
    "read_on": 2017,
    "review": "Book I used to learn by doing ReactJS, back in the day I used to go through tutorials and ReactJS Documentation. It was thanks to this book that I found Semantic UI. I wasn't keen to use Relay/GraphQL back in the day but its also covered!",
    "shopping": {
      "amazon": "https://www.amazon.com/Fullstack-React-Complete-ReactJS-Friends-ebook/dp/B07YL7J1C6"
    }
  },
  {
    "title": "Java: How to Program, 9th Edition (Deitel)",
    "author": "Paul Deitel & Harvey Deitel",
    "isbn_10": "9780132575669",
    "isbn_13": "978-0132575669",
    "publisher": "Pearson College Div",
    "read_on": 2017,
    "review": "While doing my course on Java SE 7 in ITMaster I was using this book as reference, it brings a great introduction to Java Programming.",
    "shopping": {
      "amazon": "https://www.amazon.com/Java-How-Program-9th-Deitel/dp/0132575663"
    }
  },
  {
    "title": "Java: How to Program, 9th Edition (Deitel)",
    "author": "Paul Deitel & Harvey Deitel",
    "isbn_10": "9780132575669",
    "isbn_13": "978-0132575669",
    "publisher": "Pearson College Div",
    "read_on": 2017,
    "review": "While doing my course on Java SE 7 in ITMaster I was using this book as reference, it brings a great introduction to Java Programming.",
    "shopping": {
      "amazon": "https://www.amazon.com/Java-How-Program-9th-Deitel/dp/0132575663"
    }
  },
  {
    "title": "JavaScript & jQuery: Interactive Front-End Web Development",
    "author": "Jon Duckett",
    "isbn_10": "9781118531648",
    "isbn_13": "978-1118531648",
    "publisher": "John Wiley & Sons",
    "read_on": 2014,
    "review": "This was part of the same experience as when reading \"HTML and CSS: Design and Build Websites\"",
    "shopping": {
      "amazon": "https://www.amazon.com/JavaScript-JQuery-Interactive-Front-End-Development/dp/1118531647"
    }
  },
  {
    "title": "HTML and CSS: Design and Build Websites",
    "author": "Jon Duckett",
    "isbn_10": "1118008189",
    "isbn_13": "978-1118008188",
    "publisher": "John Wiley & Sons",
    "read_on": 2014,
    "review": "After doing HTML & CSS for while I also learned JavaScript on the way. I got more and more into JavaScript but while looking for learning matereals I stepped upon Jon Duckett's Web Development Book Series and I felt in love with their approach on beatiful visual design and clear explanations. These books explains the anatomy on HTML, CSS, JavaScript and JQuery syntax using beautiful visual examples which make really easy to understand the purpose of each token. After founding these books I always recommend them for new developers who want to explore the Web Development world.",
    "shopping": {
      "amazon": "https://www.amazon.com/HTML-CSS-Design-Build-Websites/dp/1118008189"
    }
  },
  {
    "title": "Head First HTML and CSS",
    "author": "Elisabeth Robson, Eric Freeman",
    "isbn_10": "0596159900",
    "isbn_13": "978-0596159900",
    "publisher": "O'Reilly Media",
    "read_on": 2013,
    "review": "While reading Head First Python, I was also getting into Web Development by going through w3Schools tutorials. Head First Python helped me a lot understanding the \"why\" on certain statements, while w3Schools was good I wanted to go a step beyond in a more practical approach and started to read Head First HTML & CSS, I learned fundamentals on HTML & CSS from this book that helped my starting to write my own websites.",
    "shopping": {
      "amazon": "https://www.amazon.com/Head-First-HTML-CSS-Standards-Based/dp/0596159900"
    }
  },
  {
    "title": "Head First Python",
    "author": "Paul Barry",
    "isbn_10": "1449382673",
    "isbn_13": "978-1449382674",
    "publisher": "O'Reilly Media",
    "read_on": 2013,
    "review": "This was my very first introduction to programming, and I couldn't have asked for a better book to start with. Python is a simple language, it makes it easy to jump into the field and Head First Python also brings a great introduction not only to Python but also to programming in general. The book is full of exercises and examples that make it easy to understand the concepts and the language. I highly recommend this book to anyone who is looking to start programming.",
    "shopping": {
      "amazon": "https://www.amazon.com/Head-First-Python-Brain-Friendly-Guide/dp/1449382673"
    }
  }
]
